// Напишите программу, которая на вход принимает число и 
// выдает его квадрат (число умноженное 
// на само себя).

// Например:
// 4 -> 16 
// -3 -> 9 
// -7 -> 49

Console.WriteLine("Введите число");
int num = Convert.ToInt32(Console.ReadLine());

int num2= num*num;
Console.WriteLine(num2);
